app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    temp = Article.find(params[:id])
    flash_print = temp.title
    temp.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "hhalex.jpg"], ["image_updated_at", "2017-07-25 15:34:57.056787"], ["updated_at", "2017-07-25 15:34:57.082712"], ["id", 11]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)